In [1]:
import pandas as pd
df=pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [2]:
w_d=[('1/1/2017',32,7,'Rain'),
     ('1/2/2020',14,9,'Covid-19')
    ]
df1=pd.DataFrame(w_d,columns=['day','temp','windspeed','events'])
df1

        day  temp  windspeed    events
0  1/1/2017    32          7      Rain
1  1/2/2020    14          9  Covid-19

In [3]:
df.shape

(6, 4)

In [9]:
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [4]:
df1.tail()

        day  temp  windspeed    events
0  1/1/2017    32          7      Rain
1  1/2/2020    14          9  Covid-19

In [11]:
df.tail()

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [13]:
pip install xlrd

Requirement already satisfied: xlrd in c:\programdata\anaconda3\lib\site-packages (1.2.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
df2=pd.read_excel('weather_data.xlsx')
df2

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [5]:
df.day[df.temperature==df.temperature.max()]

1    1/2/2017
Name: day, dtype: object

In [6]:
df['temperature'].describe()

count     6.000000
mean     30.333333
std       3.829708
min      24.000000
25%      28.750000
50%      31.500000
75%      32.000000
max      35.000000
Name: temperature, dtype: float64

In [5]:
df[['day','event']]

        day  event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [6]:
df3=pd.read_csv('weather_data_cities.csv')
df3

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [7]:
g=df3.groupby('city')
g

In [9]:
for city,city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [10]:
g.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [11]:
g.get_group('paris')

         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [12]:
g.get_group('mumbai')

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

In [13]:
print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [14]:
print(g.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

In [18]:
print(g.head)

<bound method GroupBy.head of <pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000216327C8FC8>>

In [19]:
print(g.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [21]:
india_weather=pd.DataFrame({
    "city":["mumbai","Delhi","banglore"],
    "temperature":[32,45,80],
    "humidity":[80,60,78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     Delhi           45        60
2  banglore           80        78

In [22]:
us_weather=pd.DataFrame({
    "city":["texas","chicago","california","florida"],
    "temperature":[32,45,80,76],
    "humidity":[80,60,78,66]
})
us_weather

         city  temperature  humidity
0       texas           32        80
1     chicago           45        60
2  california           80        78
3     florida           76        66

In [23]:
pd.concat([india_weather,us_weather])

         city  temperature  humidity
0      mumbai           32        80
1       Delhi           45        60
2    banglore           80        78
0       texas           32        80
1     chicago           45        60
2  california           80        78
3     florida           76        66

In [24]:
pd.concat([india_weather,us_weather],ignore_index=True)

         city  temperature  humidity
0      mumbai           32        80
1       Delhi           45        60
2    banglore           80        78
3       texas           32        80
4     chicago           45        60
5  california           80        78
6     florida           76        66

In [26]:
temp_df=pd.DataFrame({
    "city":["texas","chicago","california","florida"],
    "temperature":[32,45,80,76]
    
})

In [27]:
humidity_df=pd.DataFrame({
    "city":["texas","california","florida"],
    "humidity":[80,60,78]
})

In [28]:
pd.merge(temp_df,humidity_df,on='city') #chicago is dropped

         city  temperature  humidity
0       texas           32        80
1  california           80        60
2     florida           76        78

In [33]:
pd.merge(temp_df,humidity_df,on='city',how='outer')

         city  temperature  humidity
0       texas           32      80.0
1     chicago           45       NaN
2  california           80      60.0
3     florida           76      78.0

In [31]:
df4=pd.concat([india_weather,us_weather],axis=1)
df4

       city  temperature  humidity        city  temperature  humidity
0    mumbai         32.0      80.0       texas           32        80
1     Delhi         45.0      60.0     chicago           45        60
2  banglore         80.0      78.0  california           80        78
3       NaN          NaN       NaN     florida           76        66

In [34]:
df5=pd.DataFrame([1,2,3,4,5,6,7,8,9,11,8,12],index=[87,86,85,98,97,96,21,20,19,0,1,2])
df5

     0
87   1
86   2
85   3
98   4
97   5
96   6
21   7
20   8
19   9
0   11
1    8
2   12

In [36]:
df5.loc[19]

0    9
Name: 19, dtype: int64

In [37]:
df5.iloc[6]

0    7
Name: 21, dtype: int64

In [38]:
df5.loc[:19]

    0
87  1
86  2
85  3
98  4
97  5
96  6
21  7
20  8
19  9